// Фильтрация по диапазону "на месте"
// важность: 4
// Напишите функцию filterRangeInPlace(arr, a, b), которая принимает 
// массив arr и удаляет из него все значения кроме тех, 
// которые находятся между a и b. 
// То есть, проверка имеет вид a ≤ arr[i] ≤ b.

// Функция должна изменять принимаемый массив и ничего не возвращать.

// Например:

// let arr = [5, 3, 8, 1];

// filterRangeInPlace(arr, 1, 4); // удалены числа вне диапазона 1..4

// alert( arr ); // [3, 1]

let arr = [5, 3, 8, 1];

function filterRangeInPlace(arr, a, b) {
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] < a || arr[i] > b) {
            arr.splice(i, 1);
            i--;
        }
    }
}

filterRangeInPlace(arr, 1, 4)
console.log(arr);

// [5, 3, 8, 1] index = 0, удалили 5
// [3, 8, 1] index = 0+1 = 1 [8], пропустили [3], поэтому index - 1;

// [5,3,8,1] i=0, i++
// [{},3,8,1]
// [3,8,1] - опять нулевой индекс берем (i--)

